; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	image3 - mode
	spectrograph2 - mode
	infrared0 - mode
	infrared1 - mode
	GroundStation0 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star6 - direction
	Star5 - direction
	Star1 - direction
	Star2 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared1)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation7)
	(supports instrument5 spectrograph2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star5)
	(supports instrument6 infrared1)
	(supports instrument6 image3)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star6)
	(supports instrument8 infrared0)
	(supports instrument8 image3)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
	(supports instrument10 image3)
	(calibration_target instrument10 Star2)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star6)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite1 GroundStation7)
	(pointing satellite2 GroundStation0)
	(pointing satellite5 Star1)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 image3)
	(have_image Star11 infrared1)
	(have_image Star12 infrared1)
	(have_image Planet13 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation7)
   goals met: 2 of 10
2. (turn_to satellite0 groundstation0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 10
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
4. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 2 of 10
5. (turn_to satellite0 planet13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet13)
   goals met: 2 of 10
6. (take_image satellite0 planet13 instrument1 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 3 of 10
7. (turn_to satellite0 planet10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet10)
   goals met: 3 of 10
8. (take_image satellite0 planet10 instrument1 image3)
   added: (have_image planet10 image3)
   goals met: 4 of 10
9. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 10
10. (take_image satellite0 phenomenon9 instrument1 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 10
11. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
12. (take_image satellite0 planet8 instrument1 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 6 of 10
13. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
14. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 10
15. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 7 of 10
16. (take_image satellite0 star12 instrument1 infrared1)
   added: (have_image star12 infrared1)
   goals met: 8 of 10
17. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 9 of 10
18. (turn_to satellite5 star1 star6)
   deleted: (pointing satellite5 star6)
   added: (pointing satellite5 star1)
   goals met: 10 of 10
